赋值 a = [1,2,3,"hello","中文"];
打印换行("list 01: ",a)
a[2] = "hello"
打印换行("list 02: ",a)
a[3] = "world";
打印换行("list 03: ",a)
打印换行("list 04: ",a[4][0])
a = a + 4
打印换行("list 05: ",a)
a = a + "五"
打印换行("list 06: ",a)
a = a - 1
打印换行("list 07: ",a)
a[0] = 空
打印换行("list 08: ",a)
a = a - a[0] - a[0] - a[0] - a[1] - a[1]
打印换行("list 09: ",a)
a = a*6
打印换行("list 10: ",a)
a = a + [1,2,3]
打印换行("list 11: ",a)
a = [1,2,3,["a","b","c"]]
打印换行("list 12: ",a)
函数 hs() {
    返回 "函数返回值"
}
a = [hs(),1,2,3]
打印换行("list 13: ",a)
