// 打印("列表Test: ",[123,'你好',[1,2,3]])
/*
赋值 a = [1,2,3];
打印(a[0])
赋值 b = [1,2,3];
b[1] = 5;
打印(b[1])
赋值 c = 空;
打印('第一次打印: ',c);
c = 132;
打印('第二次打印: ',c)
赋值 d = 10;
如果(d < 10){
    打印('hello');
}否则 如果(a <= 10 ){
    打印("结果：",'world')
}
循环(a=1 到 10) {
    打印(a)
}
循环(a 在 [0,2,3,4]) {
    打印(a)
}

赋值 e = 1;
判断循环(e <= 10){
   打印(e);
   e = e + 1;
}

函数 a(x) {
    打印(x);
}
a([1,2,3,"456"])
函数 f(x) {
    返回 x;
}
打印(f(10))

赋值 lambdaTest = (a,b) => {
    打印("结果：",a, b)
}

lambdaTest("The lambda function"," was tested successfully!")

赋值 i = 1;
赋值 a = 1;

判断循环(a <= 10){
   打印(a);
   a = a + 1;
}
开始 {
    打印("第",i,"次","打印")
    i = i + 1;
}判断循环(i <= 10)

打印("123")打印("123")
赋值 a = {
    b: 123,
    c: "456"
}
*/
