//长度(）
//列表:获取列表长度
赋值list = [1,2,3, "ni", "hao"]
打印("列表长度:",长度(list))
打印换行()
//字符串:获取字符长度
赋值str ="你好，我是Hor"
打印("字符长度:",长度(str))
打印换行()
//方法:获取方法参数的个数
打印("方法参数个数:",长度((a,b,c) =>{}))
打印换行()
//数值:转为字符获取长度
打印("教值长度:",长度(123))
打印换行()
//布尔:默认为1长度
打印("布尔长度:",长度(真))
打印换行()
//空(null):默认为1长度
打印("空(null)长度:",长度(空))
// 断言

// boolean expressions
断言(真 || 假);
断言(!假);
断言(真 && 真);
断言(!真 || !假);
断言(真 && (真 || 假));

// relational expressions
断言(1 < 2);
断言(666 >= 666);
断言(-5 > -6);
断言(0 >= -1);
断言('a' < 's');
断言('sw' <= 'sw');

// add
断言(1 + 999 == 1000);
断言([1] + 1 == [1,1]);
断言(2 - -2 == 4);
断言(-1 + 1 == 0);
断言(1 - 50 == -49);
断言([1,2,3,4,5] - 4 == [1,2,3,5]);

// multiply
断言(3 * 50 == 150);
断言(4 / 2 == 2);
断言(1 / 4 == 0.25);
断言(999999 % 3 == 0);
断言(-5 * -5 == 25);
断言([1,2,3] * 2 == [1,2,3,1,2,3]);
断言('ab'*3 == "ababab");

// power
断言(2^10 == 1024);
断言(3^3 == 27);
断言(4^(3^2) == 262144);
断言((4^3)^2 == 4096);
